// שם הלומדה
const TITLE = "לומדה עם ציון ";

//  Max number of question in exam. Make sure it isn't more than the number of questions we have!
const AMOUNT_EXAM_QUESTIONS = 10;

const TIME_FOR_EXAM = "11:00";


/*              Edit notes:
    1. Valid card types: youtube, video-and-text, pic-and-text, text, listNumbers, listDots
    2. Title class: "sub-title" , list class: "list", place on the outer element <ol> or <ul> 

                        HOW TO CREATE NEW COLOR
            search for the listed colors and switch to the desired ones
    1. Primary color: #1aa3a3;
    2. Secondary color: #67dfcb;
    3. Text color: #1f3e3e
    4. Open image + gradient color: #629191;
            */
    
    /* amountOfQuestions - max number of questions from the subject that will appear in the test*/
const DATA = { 
    "נוהל העברת דיווחים בבה\"ד": {
        "icon":  "../assets/images/learning/Artboard 4.svg",
        "learningContent": {
            "נוהל מס.1": {
                "נוהל העברת דיווחים בבה\"ד": [ 
                    {
                        cardType: "text",
                        content: "פרטי הדיווחים הנדרשים: <br> 1. תאריך <br> 2. שעה <br> 3. שם + מ.א <br> 4. שם הקורס אליו משתייך/מסגרת אלייה משתייך. <br> 5. תיאור אירוע (מה קרה, היכן קרה, סיבת האירוע)"
                    },
                    {
                        cardType: "text",
                        content: "במידה ויש פינוי רפואי: <br> 1. דחיפות הפינוי <br> 2. אופן הפינוי (רכב יחידה/אמבולנס/רכב אחר) <br> 3. שם ומ.א של החייל המלווה <br> 4. במידה ולחייל יש נשק - למי הוצמד <br> 5. בגמר הפינוי והטיפול הרפואי - תוצאות האירוע (חופשת מחלה, אשפוז, חזרה ליחידה)"
                    }
                ],
                "מועד העברת הדיווח והתחקיר": [
                    {
                        cardType: "text",
                        content: "1. דיווח ראשוני יועבר בסמוך למועד האירוע ולא יאוחר משעה לאחר קרות האירוע באמצעות הודעת Whatsapp בהתאם לפורמט 'דיווח ראשוני' / שיחה טלפונית ישירה בהתאמה לחומרה ואופי האירוע. <br> 2. באירוע פציעה/ כמעט ונפגע, מפקד הקורס/המדור יעביר תחקיר (ע\"ב פורמט תחקיר) על האירוע לא יאוחר מ72 שעות לאחר קרות האירוע. קציני בטיחות במגמות ובמדורים ירכזו את התחקירים, יבצעו בקרה על התחקיר, תיוק בקלסר הייעודי, יעבירו העתק לרע\"ן אימוני חוץ."
                    },
                    {
                        cardType: "text",
                        content: "3. אירוע פציעה/ חריג שמסווג כאירוע ברמה \"בינוני\" יתוחקר ע\"י סא\"ל ויועבר תחקיר עד 72 שעות. <br> 4. אירוע עבריינות בנשק/ תחמושת ידווח מיידית ויתוחקר ע\" סא\"ל עם העברת תחקיר תוך 72 שעות. <br> תחקירי עבריינות בנשק יוצגו למפקד הבה\"ד ולקצין הרפואה הראשי."
                    }
                ],
                "סדר העברת דיווחים בבה\"ד 10": [
                    {
                        cardType: "picAndText",
                        pic: "/assets/images/image1.jpeg",
                        content: ""
                    }
                ]
            }
        },
    },
    "נוהל דיווח באירוע בטיחות": {
        "icon":  "../assets/images/learning/Artboard 4.svg",
        "learningContent": {
            "נוהל מס.2": {
                "הגדרה": [
                    {
                        cardType: "listDots",
                        numList: "2",
                        li1: "אירוע בטיחות / חריג מוגדר כל אירוע במסגרתו חייל נפגע כתוצאה מפעילויות במסגרת הצבאית או בחופשה.",
                        li2: "מטרת הנוהל: להסדיר את כללי הדיווח מרמת מפקד הכיתה ועד מפקד הבה\"ד."                        
                    }
                ],
                "הנוהל": [
                    {
                        cardType: "text",
                        content: "אירועים לדיווח: כל אירוע במהלכו פנה חייל לבית חולים, אירוע פציעה / פגיעה / כמעט ונפגע במהלך חופשה, אירוע פציעה / פגיעה / כמעט ונפגע במהלך שהייה ביחידה או מחוץ ליחידה, אירוע ברה\"ן חריג, תאונות דרכים ועבירות תנועה, נפקדות / חשד לנפקדות."
                    },
                    {
                        cardType: "text",
                        content: "פרטים לדיווח: תאריך, שעה, שם + מ.א, שם הקורס / מסגרת אליה משתייך, תיאור אירוע (מה קרה, היכן קרה, סיבת האירוע), במידה ויש פינוי רפואי - דחיפות הפינוי, אופן פינוי (רכב יחידה / אמבולנס / רכב אחר), שם + מ.א של חייל מלווה, במידה ולחייל יש נשק - למי הוצמד, בגמר הפינוי והטיפול הרפואי - תוצאות האירוע (חופשת מחלה, אשפוז, חזרה ליחידה)."
                    },
                    {
                        cardType: "text",
                        content: "מועד העברת הדיווח והתחקיר: <br> 1. דיווח יועבר בסמוך למועד האירוע ולא יאוחר משעה לאחר קרות האירוע. <br> 2. באירוע פציעה / כמעט ונפגע - מפקד הקורס / מדור יעביר תחקיר (ע\"ב פורמט תחקיר) על האירוע לא יאוחר מ-24 שעות לאחר קרות האירוע. קציני בטיחות במגמות ובמדורים ירכזו את התחקירים, יבצעו בקרה על התחקירים, יבצעו בקרה על התחקיר, תיוק בקלסר ייעודי, יעבירו העתק לח\"מ (לא יאוחר מ-3 ימים לאחר האירוע)."
                    }
                ]
            }
        }
    },
    "אירוע שעת זהב": {
        "icon":  "../assets/images/learning/Artboard 4.svg",
        "learningContent": {
            "נוהל מס.3": {
                "הגדרה": [
                    {
                        cardType: "listDots",
                        numList: "2",
                        li1: "אירוע שעת זהב הינו אירוע מורכב ורגיש אשר יש לתת עליו את הדעת ולוודא שליטה בפקודה המחייבת ושפה משותפת עד אחרון אנשי הסגל. ניהול אירוע זה שלא ע\"פ ההנחיות המחייבות יכול להביא לכדי החמרה במצב החייל הנעדר.",
                        li2: "הגדרת \"שעת הזהב\" - חייל חסר בפעילות שלא מצליחים ליצור עימו קשר במהלך שעה ומובהר שאין נדובר בנפקדות, יוגדר כחשש לנעדר ויחלו פעולות בהתאמה לפ\"מ 38.0107 - "
                    }
                ],
                "הנוהל" : [
                    {
                        cardType: "text",
                        content: "1. הכרזת שעת זהב יוכרז וינוהל ע\"י ממ\"ג הכש\"י, ממ\"ג מפקדים או מפקד הבה\"ד.<br> 2. באירוע מסוג זה מפקד מסגרת החייל (בכיר) ינהל את האירוע יחד עם מפקד בדרגת סא\"ל לרבות חזרת מפקד בכיר ליחידה והובלת האירוע באופן אישי. <br> 3. דיווח למצ\"ח ולחמ\"ל נפגעים - בהתאמה הכוונה להפעלת איכון סלולרי בצמידות ככל שניתן ל\"שעת הזהב\"."
                    },
                    {
                        cardType: "text",
                        content: "4. הפעלת סקירות שיטתיות עם ככל הסד\"כ/ מכפילי הכרחי. <br> 5. עדכון רע\"ן משאן אט\"ל וחמ\"ל אט\"ל / חמ\"ל מקרפ\"ר. <br> 6. אין שיח ישיר עם המשפחה ללא הנחיית חמ\"ל נפגעים ואישור ממפקד בכיר (סא\"ל ומעלה)."
                    }
                ],
                "מצבים בהם יוגדר חייל כנעדר": [
                    {
                        cardType: "listDots",
                        numList: "2",
                        li1: "החייל יצא ליעד מסויים ולא הגיע אליו תוך פרק זמן סביר ואין סיבה להניח כי הוא נפקד באופן מכוון.",
                        li2: "משפחתו של החייל הודיעה על כך שאבד עמו הקשר לפרק זמן שאינו סביר, ללא כל הסבר, ואין סיבה להניח כי הוא נפקד באופן מכוון."
                    },
                    {
                        cardType: "listDots", 
                        numList: "3",
                        li1: "החייל הצהיר בעל פה או במכתב על כוונותיו לפגוע בעצמו, ולאחר מכן אבד הקשר עמו.",
                        li2: "החייל יצא לפעילות צבאית ואבד הקשר עמו לפרק זמן שאינו סביר.",
                        li3: "אירוע \"שעת זהב\" איננו אירוע נפקדות וינוהל באופן שונה מאירוע \"שעת זהב\"."
                    }
                ]
            },
        },
        
    },
    // שם נושא
    "נוהל שלילת חופשה": {
        "icon":  "../assets/images/learning/Artboard 4.svg",
        "learningContent": {
            // סוג הכרטיסייה
            "נוהל מס.8": {
                "כללי": [
                    {
                        cardType: "listNumbers",
                        numList: 2,
                        li1: "בתאריך ה-18 בנובמבר הנחה מפקד הבה\"ד אל\"מ דודי צוקרמן, כי הפעלת מפקדים של פקודת מניעת חופשה (פקודת מטכ\"ל מספר 33.0352 - עדכון אחרון במרץ 2019) תהיה בהתאמה מוחלט לרשום במסמך זה.",
                        li2: "עת כניסתו של מפקד הבה\"ד אל\"מ מיקי אלמקיאס - פקודה זו תקופה ומובאת כדלהלן במסמך זה."
                    },
                    {
                        cardType: "text", 
                        content: "3. על המפקדים בכל הדרגות, מרב-טוראי ועד לדרגות הקצונה כולל, לפעול בהתאם למפורט במסמך זה, כאשר אין אפשרות לחריגה או לפרשנות שאינה מובאת בהנחיה זו. <br> 4. בכל חריגה, שאלה או הערה לגבי ההנחייה, יש לפנות לח\"מ אשר בנוהל ישיר מול מפקד הבה\"ד יבצע עדכון למסמך זה במידת הצורך, ורק לאחר מכן יכנסו לתקופם שינויים, ככול שיהיו כאלה."
                    },
                    {
                        cardType: "text", 
                        content: "5. בכל סתירה או עדכון בפקודת מניעת חופשה - 33.0352, יגבר האמור בפקודה, למעט במקרים בהם הוטלה החמרה של מפקד היחידה. <br> 6. כנספח א' למסמך זה ניתן לעיין בפקודת מטכ\"ל 33.-352 - מניעת חופשה. <br> 7. כנספח ב' למסמך זה ניתן לעיין ברענון הנחיות ודגשי סגן הרמטכ\"ל בנושא הטיפול בפקט."
                    }
                ],
                "רקע לפקודת מניעת חופשה": [
                    {
                        cardType: "listNumbers",
                        numList: "2",
                        li1: "פקודת מניעת חופשה במתכונתה הנוכחית, נכתבה ביוני 2014, ועודכנה לאחרונה בחודש מרץ 2019.",
                        li2: "\"מניעת חופשה\" על פי הפקודה היא - \" תגובה משמעתית בגין מעשה של חייל בדרך של שלילת חופשתו, עיכוב יציאתו לחופשה או הוראה על הקדמת חזרתו ליחידה, בין שהיציאה לחופשה או החזרה ממנה, לרבות מועדן, הן על פי שגרת המחנה ובין שהן מעל-פי החלטת המפקד\"."
                    }
                ],
                "סמכות מניעת החופשה בבה\"ד 10": [
                    {
                        cardType: "listNumbers",
                        numList: "2",
                        li1: "סמכות מניעת חופשה מחייל נתונה למפקד שדרגתו סג\"ם ומעלה, המפקד על קורס בבה\"ד, ואפשרות רק עד לכמות של 5 שעות ביציאה.",
                        li2: "מפקד שדרגתו סג\"ם או סגן, ושמבקש למנוע חופשה מחייל שאינו חניך בקורס - לא מוסמך לעשות כן."
                    },
                    {
                        cardType: "text",
                        content: "3. קצין שדרגתו סרן כתף, רשאי למנוע חופשה מכל חייל ביחידה, ובלבד שתיאם עם מפקדו של החייל את הענישה (אלא אם מפקדו של החייל כפוף לקצין ואז אין חובה כזו), עד מקסימום של שלושה ימים (כלומר, חייל שאמור לצאת בחמישי ולחזור ליחידתו ביום ראשון, יכול לקבל \"שבת\" מקצין בדרגה זו, שלמעשה ישלול את חופשתו לימים חמישי, שישי, שבת - שלושה ימים)."
                    },
                    {
                        cardType: "text",
                        content: "4. שלילת חופשה מותרת מכל חייל בשירות סדיר, כולל שוחרים, כאשר שלילת חופשה לשוחר תעשה רק באישורו של קצין בדרגת אלוף-משנה, כלומר, רק על ידי מפקד בה\"ד 10. <br> 5. קצין שדרגתו רב-סרן כתף, רשאי למנוע חופשה מכל חייל ביחידה, ובלבד שתיאם עם מפקדו של החייל את הענישה (אלא אם מפקדו של החייל כפוף לקצין ואז אין חובה כזו), עד מקסימום של חמישה ימים."
                    },
                    {
                        cardType: "text", 
                        content: "6. קצין שדרגתו סגן-אלןף כתף ומעלה רשאי למנוע חופשה מכל חייל ביחידה, ובלבד שתיאם עם מפקדו של החייל את הענישה (אלא אם מפקדו של החייל לקצין ואז אין חובה כזו), עד מקסימום של שבעה ימים."
                    },
                    {
                        cardType: "text",
                        content: "7. מניעת חופשה היא סמכות המוקנית למפקדים מכורח הצורך לאכוף משמעתית ופיקודית את ההתנהלות ביחידה. מטרת הפקודה לאפשר ענישה לחייל, מבלי שהדבר מתועד בנגררת התלונות השלישותיות ומבלי למלא טופס תלונה בדין-משמעתי. מדובר באופציית ביניים שמאפשרת להעניש חייל שעבר עבירה שלדעת מפקדיו לא מצדיקה (בשל נסיבותיה, בשל אופיה או בשל נסיבות החייל או היחידה) שיפוט בדין-משמעתי, אך כן דורשת התייחסות פיקודית ומניעת חופשה."
                    }
                ],
                "סייגים למניעת חופשה בבה\"ד 10": [
                    {
                        cardType: "text", 
                        content: "1. אין למנוע חופשה מחייל אם התנהלה, מתנהלת או יש חובה לפי פקודות הצבא לקיים חקירת מצ\"ח או בדיקת קבו\"ד (קצין בודק) ביחס למעשה או למחדל, אלא באישור פרקליט צבאי בלבד. <br> 2. אין להעמיד לדין-משמעתי חייל שכבר נמנעה חופשתו בשל אותו המעשה, אלא באישור פרקליט צבאי בלבד."
                    },
                    {
                        cardType: "text",
                        content: "3. הסמכות למנוע חופשה ממספר חיילים לא מוגבלת, כלומר מותר למפקד אחד למנוע חופשה ממאות חיילים באותו היום. הדגש המרכזי הוא שיש חובה לבצע זאת באופן פרטני ואישי, לאחר בחינת כל מעשה לגופו, ולאחר מתן אפשרות לשימוע - כלומר, זכות תגובה לחייל שנמנעת חופשתו ממנו מול המפקד מונע החופשה. חל איסור חמור למנוע חופשה בצורה קולקטיבית מקבוצת חיילים!"
                    },
                    {
                        cardType: "text", 
                        content: "4. חל איסור לקבוע \"מחירון\" ענישה - נוהל כללי שמגדיר כי בכל מקרה שבו יבצע חייל מעשה מסוג שייקבע בנוהל, תימנע ממנו חופשתו. כלומר אסור, להגדיר בבה\"ד 10, שכל חניך שינוע בלי כומתה על הראש יקבל שעתיים ביציאה, ואסור להגדיר כי כל חייל שישתמש בטלפון הנייד בזמן שנאסר עליו יקבל יום ביציאה. מותר לקבוע את העונש אך ורק באופן פרטני ובלעדי כלפי העבירה וכלפי עובר העבירה באופן נפרד ואינדיבידואלי."
                    }
                ], 
                "מועדים למניעת חופשה בבה\"ד 10": [
                    {
                        cardType: "text",
                        content: "א. מרגע גילוי העבירה או מיום ביצוע העבירה (המאוחר מבין השניים) ניתנים למפקדים המוסמכים חמישה ימים בלבד לבצע את השימוע ולשלול את חופשתו של החייל הכפוף להם. באם יחלפו חמישה ימים וחייל לא יובא בפני מפקד מוסמך לביצוע שימוע, אסור למנוע את חופשתו, גם אם עדכנו אותו מפקדים אחרים על כך שהוא צפוי להגיע לשימוע שכזה."
                    },
                    {
                        cardType: "text", 
                        content: "ב. מניעת חופשה תחל מוקדם ככל האפשר, כברירת מחדל. עם זאת, לכל קצין המוסמך למנוע חופשה, יש סמכות להגדיר את מועד שלילת החופשה כמועד שיתחיל ב-14 ימים הבאים ממועד ביצוע השימוע לחיילו וההודעה לו בדבר מניעת חופשתו. <br> ג. היום הראשון למניעת חופשה ייחשב מרגע היציאה הביתה המתוכנן של החייל, ועד לשעה 08:00 בבוקר למחרת. כל יום נוסף, יימנה מהשעה 08:00 ועד לשעה 08:00 ביום המחרת."
                    }
                ],
                "אופן מניעת החופשה בבה\"ד 10": [
                    {
                        cardType: "listNumbers",
                        numList: "1",
                        li1: "המפקד המוסמך יכול להורות על מניעת חופשה של חייל רק כששני התנאים הבאים מתקיימים: <br>  1) החייל יוזמן לשימוע בתוך חמישה ימים ממועד ביצוע העבירה או גילויה (המאוחר מבין השניים), ובו יסביר המפקד לחייל את המעשה המיוחס לו ויעדכן כי הוא שוקל למנוע את חופשתו ויאפשר לו לטעון טיעוניו, בכתב  או בעל פה."
                    },
                    {
                        cardType: "text",
                        content: "  2) המפקד המוסמך יבחן את מידת הפגיעה במשמעת שיש במעשה החייל, ויתייחס ספציפית לחומרת המעשה, נסיבות ביצועו, עברו של החייל, נסיבותיו האישיות של החייל, הנזק שנגרם בעקבות המעשה וצורכי הרתעת היחיד והרבים. <br> 2. הודעה על מניעת חופשה בבה\"ד 10 אפשרית רק עד 4 שעות לכל המאוחר ממועד יציאתו המתכונן של החייל לחופשה, גם אם מדובר במתן \"שעות ביציאה\" בלבד- החמרת מפקד הבה\"ד."
                    },
                    {
                        cardType: "text",
                        content: "3. בעת ביצוע שלילית חופשה, באחריות המפקד המוסמך למנוע חופשה להגדיר את מועד תחילת מניעת החופשה ואת מועד סיומה, כל שינוי במועדים אלה מחייב עדכון החייל במיידית.  <br>4. באם המפקד המוסמך לא הודיע לחייל במועד על מניעת חופשה - ישוחרר החייל לחופשתו במועדה."
                    },
                    {
                        cardType: "text",
                        content: "5. המפקד המוסמך שמנע חופשה או מפקדו רשאים להפסיק או לבטל את מניעת החופשה, כולה או חלשה, בכל עת. <br> 6. חל איסור חמור למנוע חופשה שהחייל זכאי לה על פי הפקודות, אלא רק חופשה נורמטיבית ומתוכננת הנוהל רגיל בלו\"ז העבודה או הקורס של החייל שנמנעת חופשתו."
                    }, 
                    {
                        cardType: "text",
                        content: "שהוגדרה לו חופשת \"רגילה\", חופשה \"משפחתית\", חופשה \"מיוחדת\" או חייל שזכאי להת\"ש באמצעות מניעת חופשה! יש לשיב לב שאם לחייל יש הת\"ש 3, לדוגמא, ניתן למנוע את חופשתו לכל הסופ\"ש על ידי קצין בדרגת סרן, אך יש לוודא כי יקבל 3 אפטרים במהלך השבוע. הדרך היחידה למנוע חופשה מחייל לא במגבלות המוגדרות בסעיף זה, היא להעמידו לדין-משמעתי ולהטיל עליו ריתוק, לפי הסמכויות והכללפים הנהוגים בפקודות הדין-המשמעתי."
                    },
                    {
                        cardType: "text",
                        content: "7. מניעת חופשה מחייל על רקע כשלים מקצועיים בבה\"ד 10 אפשרית רק באישור ממ\"ג מפקדים, ממ\"ג הכש\"י או המדריך הראשי."
                    }
                ],
                "פעילות החייל בתקופת מניעת חופשתו בבה\"ד 10": [
                    {
                        cardType: "listNumbers", 
                        numList: "2", 
                        li1: "חייל שנמנעה חופשתו ישאר בבה\"ד 10, אלא אם אושר להישארו ביחידה אחרת - אישור שמוסמכים להעניק מפקדי המגמות והמד\"ר בלבד.",
                        li2: "במהלך מניעת חופשתו, יבצע החייל כל משימה צבאית שתוטל עליו, שהיא במסגרת הנורמות המאושרות ביחידה, כולל תורנויות."
                    }
                ],
                "אופן ההגעה הביתה לאחר מניעת חופשה בבה\"ד 10": [
                    {
                        cardType: "listNumbers",
                        numList: "2",
                        li1: "בתום מניעת החופשה, אם החייל יוצא לביתו, חייב המפקד שמנע את חופשתו לוודא כי יגיע לביתו בתחבורה ציבורית בבטחה ובוודאות.",
                        li2: "אם מניעת חופשה מסתיימת בערב חג, או בערב שישי, והחייל אמור לצאת לביתו, יוודא המפקד מונע החופשה כי לחייל תהיה אפשרות להגיע לביצו בתחבורה ציבורית בבטחה ובוודאות לפחות שעתיים מרגע כניסת השבת או החג."
                    }
                ],
                "טופס 633": [
                    {
                        cardType: "text",
                        content: "1. לאחר השלמת תהליך השימוע לחייל שנמנעה חופשתו, חייב המפקד המוסמך למלא את טופס 633 ולהעבירו לרס\"רית מגמת הכשרות יסוד או לרס\"ר בה\"ד 10 בתוך 24 שעות ממועד מניעת החופשה ובכל מקרה לא מאוחר יותר ממועד תחילת מניעת החופשה."
                    },
                    {
                        cardType: "text",
                        content: "2. בעת מילוי טופס 633, יש להקפיד כי על המפקד המוסמך לחתום בחתימת ידו בלבד, ולא באמצעות חותמת שהיא תבנית חתימה ידנית, וזאת לצד החתמה עם חותמת שמגדירה את דרגתו, מספרו האישי ושמו המלךא של הקצין המוסמך למנוע חופשה. <br> 3. טופס 633 לדוגמא נמצא כנספח ג' למסמך זה."
                    }
                ], 
                "עיכוב חייל לתחקור עבירה או לקיום הליך משמעתי בבה\"ד 10": [
                    {
                        cardType: "text",
                        content: "1. עיכוב של חייל לצורך תחקור עבירה או לצורך קיום הליך משמעתי מותר רק לממ\"ג הכש\"י, ממ\"ג מפקדים, המד\"ר, מפקד הנושא מינוי מ\"פ בהכש\"י או רמ\"ד במגמת מפקדים. <br> 2. עיכוב מהסוג המתואר בסעיף הקודם אפשרי רק לתקופה של עד 5 שעות, ואינו נחשב למניעת חופשה!"
                    },
                    {
                        cardType: "text",
                        content: "3. רק ממ\"ג הכש\"י, ממ\"ג מפקדים או מפקד בה\"ד 10 (קצינים בדרגת סא\"ל ומעלה) רשאים להורות על הקדמת חזרה של חייל ליחידה מחופשה לתחקור עבירה שהתגלתה במהלך חופשתו, או להעמדתו לדין משמעתי עבירה שהתגלתה במהלך חופשתו, או להעמדתו לדין משמעתי בגין עבירה כזו, ובלבד שהתחקור או ההעמדה לדין יתבצעו מיד עם הגעת החייל ליחידה, ולא יאוחר מ-5 שעות מרגע התייצבותו ביחידה. "
                    }
                ],
                "סיכום": [
                    {
                        cardType: "text",
                        content: "1. כמפקדים, שמורות לנו סמכויות נרחבות לטיפול משמעתי בפקודינו. יש להפעיל שיקול דעת בכובד ראש, ולהתאים כל פעם מחדש את האופן המתאים לתפעולו של כל אירוע עם אתגר משמעתי - לעיתים ניתן להסתפק בהערה או בנזיפה בעל-פה, לעיתים יש צורך במניעת חופשה בדמות שעות ביצאה, ולעיתים יש מקום לשלול חולשה למשך ימים או אף לשפוט חייל בדין-משמעתי. הבגרות האמיתית של מפקד נמדדת, בין השאר, באופן ניהולו האחראי והאנושי של מתח זה."
                    },
                    {
                        cardType: "text",
                        content: "2. לפי ההנחיות ודגשי סגן הרמטכ\"ל בנושא הטיפול בפרט, אין להחזיר חיילים \"מקוצרת\" - כלומר, במוצאי שבת, אלא באישור קצין בדרגת אלוף (!) בלבד. <br> 3. סגן הרמטכ\"ל מנחה לשקול בכובד ראש שלילת חופשה מחיילים, תוך התחשבות ברקע החייל וחומרת העבירה שביצע. <br> 4. הנחיית מפקד בה\"ד 1 בנושא תרגול נוסף בבית הספר לרפואה צבאית תופץ בנפרד להנחייה זו ורק על פיה יש לפעול בהיבטי החינוך, שיפור המקצועיות והקניית ידיעות והרגלים הדרושים לחיילים ביחידה."
                    }
                ]
            } 
        },
    },
    "נוהל הגעת משרתים עם רכבים פרטיים לבסיס": {
        "icon":  "../assets/images/learning/Artboard 4.svg",
        "learningContent": {
            "נוהל מס.9": {
                "מטרת הנוהל": [
                    {
                        cardType: "text",
                        content: "להסגיר הגעת המשרתים על רכב פרטי ליחידה, לרבות דו גלגלי. <br> 1. חל איסור על הגעת משרת בה\"ד 10 בשירות חובה, קבע או מילואים באמצעות רכב פרטי אל היחידה, כל חריגה מהאמור הינה בכפוף לאישור פרטני הניתן ע\"י מפקד הבה\"ד. <br> 2. חל איסור לנוע ברכב פרטי למשימות חוץ במקרים בהם המשרת שוהה בביתו ומתייצב למשימה בכל איזור גיאוגרפי בארץ (לרבות קורסים והשתלמויות)."
                    },
                    {
                        cardType: "text",
                        content: "3. חל איסור גורף על הגעת משרת (חייל בשירות חובה או קבע) באמצעות דו גלגלי אל היחידה. <br> 4. כל חריגה מהאמור הינה בסמכות ובאישור מפקד הבה\"ד בלבד בהמלך למובא במסמך זה. <br> 5. רכב פרטי - כל כלי תחבורה מנועי, לרבות אופנוע ואופניים עם מנוע עזר."
                    },
                    {
                        cardType: "text",
                        content: "6. אחת לחצי שנה (ובעת כל החלפת פיקוד של מפקד הבה\"ד) יבוצע רענון והפצה לנוהל זה ע\"י קצין בטיחות היחידתי ובהתאם למדיניות המפקד. <br> 7. אחריות מפקדים לנהל מעקב קבוע על המשרתים שתחת פיקודם שמגיעים ליחידה עם רכבם הפרטי, ולבצע בקרה על מימוש המדינות שפורסמה בנוהל זה."
                    }
                ],
                "פירוט אישור / איסור להגעה עם הרכבים פרטיים ליחידה": [
                    {
                        cardType: "picAndText",
                        pic: "/assets/images/image0.jpeg",
                        content: ""
                    }
                ]
            },
        }
    },
    "נוהל נהג ומפקד משימה בבה\"ד 10": {
        "icon":  "../assets/images/learning/Artboard 4.svg",
        "learningContent": {
            "נוהל מס.10": {
                "הגדרת בע\"ת": [
                    {
                        cardType: "listNumbers",
                        numList: "2",
                        li1: "סגנית המפקד - קצינת בטיחות בדרכים יחידתית",
                        li2: "רס\"ר - ק. רכב יחידתי <br> מטרת נוהל זה להגדיר \"נהג\" ו\"מפקד משימה\" בהתאם להוראות בטיחות בדרכים - כרך ז' מבק\"א יבשה."
                    }
                ],
                "נהג": [
                    {
                        cardType: "listNumbers",
                        numList: "3",
                        li1: "בהתאם לפקודות הצבא כל נהג בצה\"ל יעבור קליטה והכשרה ביחידה טרם נהיגה ברכב צבאי לסוגיו.",
                        li2: "נהג חדש ביחידה שעבר הסמכת נהיגה יעבור הליך של קליטה והכשרה ע\"י הסגנית והרס\"ר.",
                        li3: "נוהל זה חל על נהגים בשירות חובה, קבע ואע\"צ. חייל מילואים העתיד לנהוג ברכב צבאי יפעל בהתאם למפורט בהוראת השתלמות ריענון נהיגה לחיילי מילואים בהתאם לכרך ז'."
                    },
                    {
                        cardType: "text",
                        content: "4. נהג ביחידה יהיה רק בע\"ת אשר אושר לכך ע\"י סגנית מפקד היחידה ללא קשר לדרגתו והאם החזיק ברישיון צבאי ביחידה קודמת."
                    }
                ],
                "תהליך קליטת נהג": [
                    {
                        cardType: "listNumbers",
                        numList: "3",
                        li1: "קליטת נהג (ראיון קליטה אחרי המלצת ממ\"ג פתיחת תיק נהג).",
                        li2: "חניכה והכשרת נהג (ביצוע שעות חניכה).",
                        li3: "סיום תהליך הקליטה (אישור קצין הבטיחות היחידתית). <br>    1) כלל הנהגים נדרשים לכנס נהגים חודשי בר' קצינת הבטיחות <br>    2) כלל הנוהגים נדרש לכנס נהגים ונוהגים אחת לחציון - נוהג שלא יהיה נוכח בכנס ובכנס השלמה רישיונו יתלה."
                    }
                ],
                "משלח משימה": [
                    {
                        cardType: "listNumbers",
                        numList: "2",
                        li1: "מפקד או חייל שעבר הסמכה ע\"י קצינת הבטיחות בדרכים היחידתית.",
                        li2: "מפקד המשימה יפקד על משימת הנהיגה מתחילתה ועד סופה, או בקטע עליו הוא אמון בהתאם לתדריך המפקד המשלח, באופן מקצועי ואחראי."
                    },
                    {
                        cardType: "text",
                        content: "3. באחריות מפקד המשימה, התפקידים הבאים: <br> 1) לבצע את המשימה במלואה בדרך שתבטיח ביצוע המשימה באופן בטיחותי וע\"פ תדריך המפקד המשלח. <br> 2) לוודא כי כל הנוסעים חגורים, וע\"פ הצורך חבושים בקסדות כי רצועות הצד מחוברות, בהתאם לסוג כלי הרכב ולהוראות הבטיחות. <br> 3) לוודא שהציוד צעוגן, בתא הנהג, בתא הנוסעים."
                    },
                    {
                        cardType: "text",
                        content: "4) לעקוב אחר פעולות הנהג במהלך הנסיעה, תוך וידוא קיום ההוראות המחייבות בנסיעה, בנהיגה ובחנייה ולהעיר לו כנדרש <br> 5) לוודא כי הנהג ערני במשך כל המשימה, במקרה והנהג עייף, על מפקד המשימה להפסיק את נהיגתו לצורך התרעננות."   
                    },
                    {
                        cardType: "text",
                        content: "6) לצמצם \"הסחי דעת\" לנהג: מפקד המשימה יענה טלפון, יפעיל אמצעי אלקטורניקה, הרדיו, קשר וניווט, יוודא אי הפרעה לנהג ע\"י הנוסעים ברכב, יקפיד על הפסקות בנסיעה, על-מנת למנוע מהנהג אכילה / שתייה / עישון תוך כדי הנהיגה וכו'. <br> 7) במידה ואירעו אירועים בטחוניים ו/או משמעתיים, לעצור את המשימה ולדווח על האירוע למפקד המשלח. <br> 8) לדווח למפקד המשלח על סיום םהמשימה ועל אופן ביצועה"
                    }      
                ]
            }
        }
    },
    "נוהל הגבלת שעות פעילות ונוכחות במשרדים": {
        "icon":  "../assets/images/learning/Artboard 4.svg",
        "learningContent": {
            "נוהל מס.11": {
                "כללי": [
                    {
                        cardType: "listNumbers",
                        numList: "3",
                        li1: "היחידה בבה\"ד מורכבת מחיילים בחובה, קצינים ואנשי קבע בעלי מוטיבציה רבה לשירות.",
                        li2: "בשל הרצון לפעול ולקדם אירעו מקרים בהם סגל ההדרכה והמפקדה המשיך בפעילות עד לשעות הלילה המאוחרות.",
                        li3: "על מנת לייצר תרבות ארגונית סדורה ונורמטיבית מפקד הבה\"ד הגדיר מהן שעות העילות המקובלות ביחידה."
                    }
                ],
                "להלן הגדרות המפקד": [
                    {
                        cardType: "listNumbers",
                        numList: "4",
                        li1: "הימצאות סגל ומפקדים במשרדים תתאפשר עד השעה 00:00.",
                        li2: "חריגה מפעילות עד השעה 01:00 באישור ממ\"ג / מפקד המדור.",
                        li3: "הימצאות סגל ומפקדים במרחב שמחוץ למגורים תתאפשר עד השעה 01:00.",
                        li4: "חריגה מעבר לשעה 01:00 - באישור מפקד הבה\"ד."
                    }
                ]
            }
        }
    },
    "נוהל תורנות מב\"ס תורן": {
        "icon":  "../assets/images/learning/Artboard 4.svg",
        "learningContent": {
            "נוהל מס.12": {
                "כללי": [
                    {
                        cardType: "text",
                        content: "החל מתאריך 22.12.19, החלה תורנות בהד\"ית בהנחיית מפקד הבה\"ד: מב\"ס תורן."

                    }
                ],
                "מטרת המסך": [
                    {
                        cardType: "listNumbers",
                        numList: "2",
                        li1: "פירוט פוטנציאל מבצעי תורנות.",
                        li2: "הגדרת אחריות וסמכות לבעלי התפקידים בביצוע התורנות באמצ\"ש ובסופ\"ש."
                    }
                ],
                "פוטנציאל בע\"ת התורנות": [
                    {
                        cardType: "listNumbers",
                        numList: "2",
                        li1: "בעלי תקן רס\"ן ומעלה",
                        li2: "מ\"פ ותיק בבה\"ד"
                    }
                ],
                "שיטה": [
                    {
                        cardType: "listNumbers",
                        numList: "3",
                        li1: "תורנות מב\"ס תורן תתבצע בכלל ימות השבוע על בסיס פוטנציאל קצינים בכירים.",
                        li2: "שעות התורנות החל מ: 12:00 ועד למחרת ב12:00 (מיום א' שעה 12 ועד יום ה' בשעה 12:00, בחלוקה ל-4 תורניות בשבוע).",
                        li3: "בסופי שבוע וחגים, מב\"ס תורן נדרש לזמינות מלאה, מוכנות להקפצה ובעל יכולת הגעה ליחידה תוך 3 שעות."
                    },
                    {
                        cardType: "text",
                        content: "4. קביעת חלוקת התורנות תתבצע שבועיים קדימה ע\"י הסגנית / קמב\"צית ותירשם בלו\"ז המפקד למעלה (בצבע אדום). <br> 5. באחריות הקמב\"צית שליחת הודעת סמס בה\"די אחת ליום שעה 10:00) עם שם המב\"ס התורן לאחר ביצוע וידוא בע\"ת הנכנס. <br> 6. הקצין המבצע את התורנות ישהה כל שעות היממה במרחב קריית ההדרכה. אין אישור יציאה מחוץ לבסיס, גם לא למשימה קצרה."
                    },
                    {
                        cardType: "text",
                        content: "7. ניתן להחליף בחלק משעות התורנות בין בע\"ת, מחייב עדכון של הקמב\"צית / סגנית. <br> 8. כל החלפה של בע\"ת בביצוע תורנות מלאה, מחייב עדכון קמב\"צית ווידוא העדכון בלו\"ז המפקד (האחריות חלה על מבצע התורנות). <br> 9. על בע\"ת המבצע את התורנות חלה חובת זמינות מיידית בפל'."
                    }
                ],
                "משימות אחרות": [
                    {
                        cardType: "text",
                        content: "1. הקצין יהווה קצה למענה מיידי עבור מפקד הבה\"ד בנושאים הבאים: <br> 1) אירועים חריגים בבה\"ד. <br> 2) אירועי בטיחות בבה\"ד. <br> 3) ליווי ביקורת פתע ביחידה."
                    }
                ],
                "אירועים המחייבים התערבות/ פתרון מידי ומהיר": [
                    {
                        cardType: "listDots",
                        numList: "2",
                        li1: "כל תחום או נושא שבו נדרשת נוכחות מפקד ו / או בקרה מטעם מפקד הבה\"ד.",
                        li2: "כחלק משגרת הבה\"ד, ולאור בכירות בע\"ת המבצעים את התורנות באחריות מב\"ס תורן לבצע סיור בבה\"ד בהתאם להחלטתו על מנת לעמוד על שגרת הבה\"ד בשעות הערב - הלילה (לאור הקטנת נוכחות)."
                    }
                ]
            }
        }
    },
    "נוהל מדיניות סיורי חינוך": {
        "icon":  "../assets/images/learning/Artboard 4.svg",
        "learningContent": {
            "נוהל מס.13": {
                "כללי": [
                    {
                        cardType: "text",
                        content: "בבה\"ד 10 מתקיימים סיורי חינוך כחלק מהעצמת החניכים."
                    }
                ],
                "מדיניות סיורי החינוך בבה\"ד כיום": [
                    {
                        cardType: "listDots",
                        numList: "1",
                        li1: "מגמת הכשרות יסוד: <br> מתווה ראשון - סיור בירושלים, מיועד לקורסי חושבים קרביים: <br> האתרים בהם נבקר במהלך הסיור - 1) חאן שער הגיא - אתר מורשת לאומי. ממוקם בציר של נחל נחשון על הדרך המרכזית המחברת בין השפלה לירושלים. על דרך זו התחוללו קרבות עזים במלחמת העצמאות ולזכרם של הגברים והנשים שלקחו בהם חלק, הוקם בחאן מרכז מורשת המוקדש לבקיעי הדרך אל העיר ירושלים."
                    },
                    {
                        cardType: "text",
                        content: "2) הר הרצל כולל ביקור בהיכל הזיכרון - מערך שיעור על שלמה הפשטיין המועבר ע\"י מפקד הקורס, מערך שיעור המועבר על ידי א' חינוך של הקורס (השיעור נבנה עם מש\"קית החינוך בהתאם לרצון של א' חינוך), סיור מודרך בהיכל הזיכרון.<br> 3) התנדבות בבית הכהן - מרכז בית כהן מהווה בית חם ומכיל עבור 74 דיירים עם מוגבלות שכלית והתפתחותית בגילאי 21-78."
                    },
                    {
                        cardType: "text",
                        content: "מתווה שני - סיור בנגב - מיועד לשאר קורסי החובשים: <br> 1) מרכז מבקרים מצפה רמון - מרכז המבקרים של רשות הטבע והגנים ניצב על שפת מכתש רמון. במקום מצוי חומר הסברתי ותצוגה אור-קולית על נופי הטבע החי והצומח במכתש."
                    },
                    {
                        cardType: "text", 
                        content: "מתווה שלישי - סיור בירושלים - מיועד לטירונות פלוגה א': <br> 1) הר הרצל כולל ביקור בהיכל הזיכרון, סיור ברובע היהודי, סיור במנהרות הכותל. (מתווה הסיור משתנה בהתאם לצורכי היחידה ואילוצים של החייל)."
                    },
                    {
                        cardType: "text",
                        content: "במגמת מפקדים - <br> 1. בכל קורס מתקיים סיור חינוך באזור שונה בארץ עפ\"י החלטת מפקד הקורס. <br> מחלקת ההדרכה - <br> 1. מתקקים סיור חינוך מרוכז לכלל ההכנות יחד אחד לשלושה חודשים. <br> מפקדה - <br> 1. אחת לחצי שנה מתקיים טיול למפקדת הבה\"ד - אזור שונה בארץ בכל פעם. <br> לעיתים מתקיימות תרבות יום א' באיזורים שונים בארץ."
                    },
                    {
                        cardType: "text",
                        content: "שבועות למידה - <br> הסיורים מתקיימים באזורים שונים בארץ - בהחלטת מפקד המגמה. בשבועות הלמידה ניתן לממש ואוצ'רים לאתרים שונים ברחבי הארץ. <br> לקורסים שסוגרים שבת + חגים: <br> 1. יום שישי - נוכחות בפתיחת השבת של רמ\"ד החינוך יואב רגב, להקת ג'ויה. <br> 2. יום שבת (אופציה) - סיור בשביל המטיילים הנמצא בקריית ההדרכה (פעילות זו מאושרת ע\"י רב קריית ההדרכה ואינה מחללת את השבת) והעברת מערך השיעור - \"השבת שלי\"."
                    }
                ]
            }
        }
    },
    "נוהל תרגול נוסף": {
        "icon":  "../assets/images/learning/Artboard 4.svg",
        "learningContent": {
            "נוהל מס.14": {
                "כללי": [
                    {
                        cardType: "listNumbers",
                        numList: "2",
                        li1: "ב-18 בנובמבר הנחה מפקד הבה\"ד, אל\"מ דודי צוקרמן, כי הפעלת מפקדים של פקודת התרגול הנוסף תהיה בהתאמה מוחלטת לרשום במסמך זה.", 
                        li2: "על המפקדים בכל הדרגות, מרב\"ט ועד לדרגות הקצונה כולל, לפעול בהתאם למפורט במסמך זה, כאשר אין אפשרות לחריגה או לפרשנות שאינה מובאת בהנחיה זו."
                    }, 
                    {
                        cardType: "text",
                        content: "3. בכל חריגה, שאלה או הערה לגבי ההנחייה יש לפנות לח\"מ, אשר בנוהל ישיר מול מפקד הבה\"ד יבצע עדכון למסמך זה במידת הצורך, ורק לאחר מכן יכנסו לתוקפם שינויים, ככל שיהיו כאלה. <br> 4. בכל סתירה או עדכון בפקודת התרגול הנוסף - 33.0351, יגבר האמור בפקודה, למעט במקרים בהם הוטלה החמרה של מפקד היחידה. <br> 5. כנספח א' למסמך זה ניתן לעיין בפקודת מטכ\"ל 33.0351 - תרגול נוסף."
                    }
                ],
                "רקע לפקודת התרגול הנוסף": [
                    {
                        cardType: "listNumbers", 
                        numList: "2",
                        li1: "פקודת התרגול הנוסף במתכונתה הנוכחית נכתבה בפברואר 2012, ועודכנה לאחרונה בחודש מרץ 2019.",
                        li2: "\"תרגול נוסף\" על פי הפקודה הוא - \"תרגול חוזר המקנה לחייל ידיעות והרגלים דרושים (כגון ציות, דייקנות, מהירות, יעילות וביטחון) למילוי משימותיו בהצלחה, לרבות הדרכה, הכשרה, אימון, שינון, הטלת משימות והטמעת הרגלים אשר מוטלים כתגובה פיקודית\"."
                    }
                ],
                "סמכות הפעלת פקודת התרגול הנוסף בבה\"ד 10": [
                    {
                        cardType: "listNumbers", 
                        numList: "1",
                        li1: "כל מפקד בבה\"ד 10, שהוענק לו שרוך על ידי מפקד הבה\"ד או באישורו, ודרגתו רב\"ט ומעלה, מוסמך להטיל תרגול נוסף על כל חייל, ובלבד שהוא כפוף לו בשרשרת הפיקוד. כך, למשל, מפקד כיתה במגמת הכשרות יסוד, רשאי להטיל תרגול נוסף על חיילי כיתתו האישית בלבד ולא על חיילי הכיתות האחרות. מפקד הקורס, לעומת זאת, רשאי להטיל תרגול נוסף על כך חייל, בכל כיתה, בקורס עליו הוא מפקד בלבד, ולא על חניכים מקורסים אחרים. סמ\"פ או מ\"פ רשאים להטיל תרגול נוסף על כל החיילים במגמה, אך לא על חיילים ממגמת מפקדים."
                    },
                    {
                        cardType: "text",
                        content: "2. הטלת תרגול נוסף בבה\"ד 10 אפשרית רק כלפי חניכים בקורסים, אלא אם הופעלה בידי קצין בוגר בה\"ד 1, הנושא שרוך הדרכה המוגדר בסעיף 7. <br> 3. הטלת תרגול נוסף אפשרית רק בתחום הנדרש למילוי תפקידו של החייל. לדוגמה, איש סגל במגמת מפקדים, שמעוניין לתרגל חניך שאינו עומד בזמנים וכפוף לו בשרשרת הפיקוד רשאי להטיל עליו תרגול נוסף, משום שעמידה בזמנים נדרשת למילוי תפקידו של החניך כחייל."
                    },
                    {
                        cardType: "text",
                        content: "4. תרגול נוסף יכול להיות מוטל רק לתחום שבו נתגלה הליקוי או שבו נדרש שיפור במקצועיות, ביעד או בהרגלים של החייל. כך למשל, לא ניתן להטיל תרגול חוזר שקשור בעמידה בזמנים לחייל שהשתמש בטלפון הנייד במקום או במועד שהיו אסורים - במקרה מסוג ה ניתן לטפל משמעתית, בהתאם לפקודות הצבא המאפשרות מניעת חופשה או העמדה לדין משמעתי."
                    },
                    {
                        cardType: "text",
                        content: "5. בשום מקרה אין להטיל תרגול נוסף על חיילים שאינם נזקקים לו, ואין להטיל תרגול נוסף כשמטרתו העיקרית היא ענישת החייל. תמיד תכליתו המרכזית של תרגול נוסף תהיה הקניית ידיעות והרגלים דרושים."
                    }
                ],
                "כללים לביצוע תרגול נוסף": [
                    {
                        cardType: "listNumbers",
                        numList: "2",
                        li1: "תרגול נוסף לקבוצת חיילים מותר רק כשהוא נדרש לשיפור תפקוד הקבוצה כקבוצה. חל איסור לתרגל קבוצת חיילים בשלמותה, כשהתרגול נדרש כדי לשפר את תפקודם של אחד או אחדים מהקבוצה בלבד.",
                        li2: "תרגול נוסף יתבצע אך ורק ביום שבו נתגלה הליקוי, בשעות הפעילות הרגילות, כפי שמוגדרות בפק\"ש השבועי או בלו\"ז המתכונן והמאושר, להוציא את הסמכויות לחריגה המתאורת מסעיף 18 ואילך למסמך זה."
                    },
                    {
                        cardType: "text",
                        content: "3. המפקד שהטיל את התרגול או אישור אותו יוודא כי בסיום התרגול הנוסף יתאפשר לחייל להגיע לביתו עוד באותו היו באמצעות תחבורה ציבורית, אם אמור היה החייל לצאת הביתה בסוף אותו היום. <br> 4. תרגול נוסף ניתן להכיל על כל חייל בשירות הסדיר (חובה או קבע), או על אזרח בתהליכי גיוס מוקדמים (לדוגמא שוחרים). <br> 5. בהחמרת מפקד הבה\"ד - חל איסור להפעיל תרגול נוסף על חיילים בשירות מילואים."
                    }
                ],
                "סמכויות לחריגה בביצוע תרגול נוסף": [
                    {
                        cardType: "listNumbers",
                        numList: "1",
                        li1: "ממ\"ג הכש\"י, ממ\"ג מפקדים, המד\"ר, מפקד הנושא מינוי מ\"פ בהכש\"י או רמ\"ד במגמת מפקדים, רשאים לאשר ביצוע תרגול נוסף שלא ביום שבו נתגלה הליקוי."
                    }, 
                    {
                        cardType: "text",
                        content: "ממ\"ג הכש\"י, ממ\"ג מפקדים, המד\"ר, מפקד הנושא מינוי מ\"פ בהכש\"י או רמ\"ד במגמת מפקדים, רשאים לאשר ביצוע תרגול נוסף בשעות הפעילות החורגות משעות הפעילות הרגילות (אלא אם הקורס היה אחרי השעה 22:00 בלו\"ז מתכונן ומאושר מראש - ואז הסמכויות נתונות לכל מפקד כמו בכל לו\"ז שגרתי אחר)."
                    },
                    {
                        cardType: "text",
                        content: "3. ממ\"ג הכש\"י, ממ\"ג מפקדים, המד\"ר, מפקד הנושא מינוי מ\"פ בהכש\"י או רמ\"ד במגמת מפקדים, רשאים לאשר ביצוע תרגול נוסף גם אחרי השעה 22:00, וללא תלות בלו\"ז הקורס מתוכנן. <br> 4. כל תרגול נוסף נדרש בקבלת אישור מהמד\"ר, ממפקד הנושא מינוי מ\"פ בהכש\"י או מרמ\"ד במגמת מפקדים, באופן בלעדי וייחודי, ואין אפשרות להעניק אישור גורף או אישור מראש."
                    },
                    {
                        cardType: "text",
                        content: "5. בכל ביצוע של תרגול נוסף יש לפעול לפי כל כללי הבטיחות (למשל עומסי חום) ונהלי בה\"ד והצבא, בכללי זה התייחסות לסרגל מאמצים. מצופה מכל מפקד שמטיל תרגול חוזר להפעיל שיקול דעת מחמיר בכל התלבטות - ולהימנע ממעבר על הפקודות או ביצוע תרגול חוזר \"מוגזם\" או \"מיותר\"."
                    }
                ],
                "סיכום": [
                    {
                        cardType: "listNumbers",
                        numList: "1",
                        li1: "פקודת התרגול הנוסף היא פקודה מרכזית בהכשרות החיילים בצבא, המאפשרת חינוך והקניית ידיעות והרגלים הדרושים לחיילים, אך יש לזכור כי הסמכויות הניתנות למפקדים ברחבות ויש להשתמש בהן בתבונה, מתוך חשיבה, ערכיות ובגרות, ולצד שיקול ברור כי תכלית התרגול הנוסף היא שיפור מקצועי ולא ענישה."
                    },
                    {
                        cardType: "text",
                        content: "2. יש להקפיד כי תרוגל נוסף מתבצע תמיד באותו התחום בו נתגלה הליקוי ובאמצעות אותו התחום בלבד. לא ניתן להנחות חייל לעשות שכיבות סמיכה אם הוא איחר לזמנים, לא ניתן להורות לייל להקיף עמודים אם הוא דיבר ב-\"ח\" או לרוץ לנקודה כלשהי. במקרה של חייל שלא עומד בזמנים, בהחלט ניתן להגדיר לו זמנים נוספים שוב ושוב, עד אשר יתרשם המפקד כי תחום זה אכן השתפר."
                    },
                    {
                        cardType: "text",
                        content: "3. בכל מקרה של התרשמות מפקדים שכוללת זיהוי עבירות משמעתיות או הצדקה לענישה - אין פקודה זו נותנת מענה! העיסוק בתחום המשמעת, מקטן ועד גדול, יהיה אך ורק על ידי מניעת חופשה ופקודות הצבא בתחום זה. <br> 4. הנחיית מפקד בה\"ד 10 בנושא מניעת חופשה וענישה בבית הספר לרפואה צבאית תופץ במקביל להנחייה זו ורק על פיה יש לפעול בהיבטי הטיפול המשמעתי ביחידה."
                    }
                ]
            }
        }
    }
};



/********************************************************************************************************/
/********************************************************************************************************/
/********************************************************************************************************/
/*****  אובייקטים לפי סוג הכרטיסייה המכניסים את התוכן של כל כרטיסייה אל תוך הכרטיסייה  ********/

/**
 * # @type {{[index: string]: {init: (card: HTMLElement, json: any) => void}}}
 */
let CARD_TYPES = {};

CARD_TYPES.text = {
    init(card, json) {
        if (!json.content) {
            throw new Error(`Missing content in cardType text`);
        }
        card.querySelector(".content").innerHTML = json.content;
    }
}

CARD_TYPES.picAndText = {
    init(card, json) {
        card.querySelector(".pic").src = json.pic;
        card.querySelector(".content").innerHTML = json.content;
        if (!json.content) {
            card.querySelector(".content").remove();
        }
    }
}

CARD_TYPES.videoAndText = {
    init(card, json) {
        card.querySelector(".video").src = json.video;
        card.querySelector(".content").innerHTML = json.content;
        if (!json.content) {
            card.querySelector(".content").remove();
        }
    }
}

CARD_TYPES.youtube = {
    init(card, json) {
        if (!json.youtube.includes("embed")) {
            throw new Error("Make sure all youtube links are ment to be embedded and not watched");
        } else {
        card.querySelector(".youtube").src = json.youtube;
        card.querySelector(".content").innerHTML = json.content;
            if (!json.content) {
                card.querySelector(".content").remove();
            }
        }
    }
}

CARD_TYPES.listDots = {
    init(card, json) {
        for (let num = 1; num <= Number(json.numList); num++) {
            card.querySelector(".list").innerHTML += `<li>${json["li"+num]}</li>`;
        }
    }
}
CARD_TYPES.listNumbers = {
    init(card, json) {
        for (let num = 1; num <= Number(json.numList); num++) {
            card.querySelector(".list").innerHTML += `<li>${json["li"+num]}</li>`;
        }
    }
}

